#include <iostream>
using namespace std;

// 面向对象的三大特性：封装、继承、多态
// 泛型编程：写一套代码，可以适用于多种数据类型，而不用为每一种类型重新写一份。
// C++的 面向对象 和 泛型编程 思想，目的就是 复用性的提升

// STL(Standard Template Library)
// STL从广义上分为：容器(container)、算法(algorithm)、迭代器(iterator)
// 容器 和 算法 直接通过迭代器进行无缝连接
// STL几乎所有的代码都采用了 模板类 或者 模板函数

// STL广义上分为3件，细分分为6组件：
// 容器、算法、迭代器、仿函数、适配器、空间配置器

// 1. 容器：各种数据结构，如vector、list、deque、set、map等, 用来存放数据。
// 2. 算法：各种常用的算法，如sort、find、copy、for_each等
// 3. 迭代器：扮演了容器与算法之间的 胶合剂(沟通的桥梁)。
// 4. 仿函数：行为类似函数，可作为算法的某种策略（重载()操作符）。
// 5. 适配器：一种用来修饰容器或者仿函数或迭代器接口的东西。
// 6. 空间配置器：负责空间的配置与管理。






int main()
{





	system("pause");
	return 0;
}